app/controllers/pawns_controller.rb

UPDATE "pawns" SET "face" = $1, "updated_at" = $2 WHERE "pawns"."id" = $3  [["face", "WEST"], ["updated_at", "2023-08-04 06:50:21.938379"], ["id", 841]]
---
  def process_command
    @chess_service = ChessService.new(@pawn, session)
    result = perform_action

    if result == 'REPORT'
      flash.now[:notice] = get_report(@pawn)
    else
      flash.now[:notice] = 'Pawn was successfully Moved.'
      @pawn.update(result)