app/controllers/pawns_controller.rb

INSERT INTO "pawns" ("id", "x", "y", "face", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["id", 1691126013], ["x", nil], ["y", nil], ["face", nil], ["color", nil], ["created_at", "2023-08-04 05:13:33.330010"], ["updated_at", "2023-08-04 05:13:33.330010"]]
---
  def chess_board
    @pawn = Pawn.find_or_create_by(id: game_id)

UPDATE "pawns" SET "x" = $1, "y" = $2, "face" = $3, "color" = $4, "updated_at" = $5 WHERE "pawns"."id" = $6  [["x", 0], ["y", 0], ["face", "NORTH"], ["color", "WHITE"], ["updated_at", "2023-08-04 05:13:38.621154"], ["id", 1691126013]]
---
  def process_command
    @chess_service = ChessService.new(@pawn, session)
    result = perform_action

    if result == 'REPORT'
      flash.now[:notice] = get_report(@pawn)
    else
      flash.now[:notice] = 'Pawn was successfully Moved.'
      @pawn.update(result)