app/controllers/concerns/chess_actions.rb

SELECT "pawns".* FROM "pawns" WHERE "pawns"."id" = $1 LIMIT $2  [["id", 841], ["LIMIT", 1]]
---
    def find_pawn
      @pawn = Pawn.find(params['id'])